## Pandas

In [4]:
pip install pandas

Requirement already satisfied: pandas in c:\users\amaan\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\amaan\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\amaan\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\amaan\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\amaan\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\amaan\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
import pandas as pd
import numpy as np

In [40]:
# Creating Dataframe
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['column1','column2','column3','column4'])
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [42]:
# coverting dataframe to csv file
df.to_csv("Practice_set1.csv")

In [44]:
# Accessing Elements Rows
df.loc['Row2']

column1    4
column2    5
column3    6
column4    7
Name: Row2, dtype: int32

In [46]:
# Accesing Elements rows and columns
df.iloc[0:3,0:2]

      column1  column2
Row1        0        1
Row2        4        5
Row3        8        9

In [48]:
# dataframe to array
df.iloc[0:2,0:].values

array([[0, 1, 2, 3],
       [4, 5, 6, 7]])

In [56]:
df.isnull().sum() # Null values in column and sums for each row

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [66]:
print(df['column1'])
print(df.loc['Row3'])

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: column1, dtype: int32
column1     8
column2     9
column3    10
column4    11
Name: Row3, dtype: int32

In [70]:
df['column3'].unique() # Displays all the unique values

array([ 2,  6, 10, 14, 18])

In [74]:
df['column3'].value_counts() # Counts the iteration of each value

column3
2     1
6     1
10    1
14    1
18    1
Name: count, dtype: int64

In [90]:
df[['column2','column3']] # Accessing Multiple columns together

      column2  column3
Row1        1        2
Row2        5        6
Row3        9       10
Row4       13       14
Row5       17       18